
## :x: Apply Failed

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15225562731)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Reading...
module.ecr.aws_ecr_repository.ecr_repository: Refreshing state... [id=lambda-bot-prod]
module.lambda.aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/lambda-bot-prod]
module.api_gateway.aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/lambda/lambda-bot-prod-api-gateway]
module.api_gateway.aws_apigatewayv2_api.lambda_api: Refreshing state... [id=0pdgg6nqu1]
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Read complete after 0s [id=2690255455]
module.lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-bot-prod-role]
module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment: Refreshing state... [id=lambda-bot-prod-role-20250524055713202500000001]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Refreshing state... [id=lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy]
module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage: Refreshing state... [id=$default]
module.lambda.aws_lambda_function.lambda: Refreshing state... [id=lambda-bot-prod]
module.lambda.aws_lambda_alias.lambda: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:prod]
module.api_gateway.aws_lambda_permission.allow_apigateway: Refreshing state... [id=AllowInvokeFromApiGateway]
module.api_gateway.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=vfdjtep]
module.api_gateway.aws_apigatewayv2_route.lambda_function_route: Refreshing state... [id=n414fla]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_secret_manager_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda.aws_iam_role_policy.lambda_secret_manager_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_secret_manager_policy" {
        id          = "lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy"
        name        = "lambda-bot-prod-secret-manager-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3",
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-bot-token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-signing-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m10s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m10s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m20s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m20s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m30s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m30s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m40s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m40s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m50s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [00m50s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m00s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m00s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m10s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m10s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m20s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m20s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m30s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m30s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m40s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m40s elapsed]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m50s elapsed]
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Still creating... [01m50s elapsed]
╷
│ Error: creating Secrets Manager Secret (slack-signing-secret): operation error Secrets Manager: CreateSecret, https response error StatusCode: 400, RequestID: 27e18c08-2b7d-4d5d-93bc-296d83b9389b, InvalidRequestException: You can't create this secret because a secret with this name is already scheduled for deletion.
│ 
│   with module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret,
│   on ../../modules/secretsmanager/aws_secretsmanager_secret.tf line 1, in resource "aws_secretsmanager_secret" "secretsmanager_secret":
│    1: resource "aws_secretsmanager_secret" "secretsmanager_secret" {
│ 
╵
╷
│ Error: creating Secrets Manager Secret (slack-bot-token): operation error Secrets Manager: CreateSecret, https response error StatusCode: 400, RequestID: 6bdd9df7-855a-47e7-ac94-c4ea0219ec75, InvalidRequestException: You can't create this secret because a secret with this name is already scheduled for deletion.
│ 
│   with module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret,
│   on ../../modules/secretsmanager/aws_secretsmanager_secret.tf line 1, in resource "aws_secretsmanager_secret" "secretsmanager_secret":
│    1: resource "aws_secretsmanager_secret" "secretsmanager_secret" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"cd466584c393a322f3e9b3a08b3989cd70df4003","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->